cases/PH/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-10;

boundaryField
{
    "(inlet|outlet)"
    {
        type            cyclic;
    }

    "(front|back)"
    {
        type            empty;
    }

    "(top|hills)"
    {
        //type            zeroGradient;
		type            fixedValue;
        value           uniform 1e-10;
    }
}

// ************************************************************************* //
