cases/PH/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// this file has been created by prof. hence the order.

libs   ("libkOmegaSSTductFix.so");
application   simpleFoam;
startFrom   startTime;
startTime   0;
stopAt   endTime;
endTime   20000;
deltaT   1;
writeControl   timeStep;
writeInterval   2000;
purgeWrite   1;
writeFormat   ascii;
writePrecision   8;
writeCompression   off;
timeFormat   general;
timePrecision   8;
runTimeModifiable   false;

functions
{
    #includeFunc "sampleDict"
}

// ************************************************************************* //
